from .config import KEYBOARD, VERSION, AUTHOR

trading_store = """

<b>Вас вітає книгарня Читальня!</b>

"Читальня" - це бот-книгарня, що забезпечує доступ до широкого асортименту книг на будь-який смак та вікову категорію. 
За допомогою цього бота користувачі можуть швидко знайти та придбати паперові книги 
або електронні версії за інтересуючими їх жанрами, авторами або назвами. Крім того, бот також надає користувачам змогу здійснювати пошук за популярними рекомендаціями, новинками та акціями. 
Завдяки зручному інтерфейсу та швидкому обробленню замовлень, "Читальня" створює комфортну та захоплюючу атмосферу для всіх любителів читання.

"""

settings = """
<b>Загальні налаштування:</b>

<i>Навігація:</i>

-<b>({}) - </b><i>назад</i>
-<b>({}) - </b><i>вперед</i>
-<b>({}) - </b><i>збільшити кількість</i>
-<b>({}) - </b><i>зменшити кількість</i>
-<b>({}) - </b><i>наступний товар</i>
-<b>({}) - </b><i>попередній товар</i>

<i>Спеціальні кнопки:</i>

-<b>({}) - </b><i>Видалити</i>
-<b>({}) - </b><i>Замовлення</i>
-<b>({}) - </b><i>Оформити замовлення</i>

<i>Загальна інформація:</i>

<b>Виникають питання?</b>
<b>Звертайтесь до @srebniukk </b>


""".format(
    KEYBOARD['<<'],
    KEYBOARD['>>'],
    KEYBOARD['UP'],
    KEYBOARD['DOUWN'],
    KEYBOARD['NEXT_STEP'],
    KEYBOARD['BACK_STEP'],
    KEYBOARD['X'],
    KEYBOARD['ORDER'],
    KEYBOARD['APPLAY'],
    VERSION,
    AUTHOR,
    KEYBOARD['COPY'],
)

product_order = """
Обраний товар:

{}
{}
Вартість: {} гривень

Доданий в замовлення

"""

order = """

<i>Назва:</i> <b>{}</b>

<i>Автор:</i> <b>{}</b>

<i>Вартість:</i> <b>{} гривень за 1 шт.</b>

<i>Кількість:</i> <b>{} шт.</b> 
"""

order_number = """

<b>Позиція в замовленні № </b> <i>{}</i>

"""

no_orders = """
<b>Ваша корзина пуста</b>
"""

applay = """
<b>Ваше замовлення оформлене</b>

<i>Загальна вартість замовлення:</i> <b>{} гривень</b>

"""

MESSAGES = {
    'trading_store': trading_store,
    'product_order': product_order,
    'order': order,
    'order_number': order_number,
    'no_orders': no_orders,
    'applay': applay,
    'settings': settings
}
